        IDENTIFICATION DIVISION.
        Author.  Ashish Upadhaya.
        PROGRAM-ID. Y2K-Problem.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 YEAR PIC 9(2).

        PROCEDURE DIVISION.
        MAIN-PROCEDURE.
        MOVE 00 TO YEAR.
        DISPLAY YEAR.

        STOP RUN.
